# Задание-2.
#
# Описание:
# Представлен список чисел.
# Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
#
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка.
# Для формирования списка использовать генератор.
#
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].
#
""
base_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]

print("Начальный список чисел:",base_list)

new_list = [el for k, el in enumerate(base_list) if k > 0 and el > base_list[k-1]]
print("Список значений из начального списка, которые больше предыдущего",new_list)
